<html lang="en">
<head>
<title>Symbols - Debugging with GDB</title>
<meta http-equiv="Content-Type" content="text/html">
<meta name="description" content="Debugging with GDB">
<meta name="generator" content="makeinfo 4.13">
<link title="Top" rel="start" href="index.html#Top">
<link rel="prev" href="Languages.html#Languages" title="Languages">
<link rel="next" href="Altering.html#Altering" title="Altering">
<link href="http://www.gnu.org/software/texinfo/" rel="generator-home" title="Texinfo Homepage">
<!--
Copyright (C) 1988-2019 Free Software Foundation, Inc.

Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3 or
any later version published by the Free Software Foundation; with the
Invariant Sections being ``Free Software'' and ``Free Software Needs
Free Documentation'', with the Front-Cover Texts being ``A GNU Manual,''
and with the Back-Cover Texts as in (a) below.

(a) The FSF's Back-Cover Text is: ``You are free to copy and modify
this GNU Manual.  Buying copies from GNU Press supports the FSF in
developing GNU and promoting software freedom.''
-->
<meta http-equiv="Content-Style-Type" content="text/css">
<style type="text/css"><!--
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }

Unrolling means that <code>whatis</code> will show the underlying type used
in the <code>typedef</code> declaration of <var>arg</var>.  However, if that
underlying type is also a <code>typedef</code>, <code>whatis</code> will not
unroll it.

     <p>For C code, the type names may also have the form &lsquo;<samp><span class="samp">class
</span><var>class-name</var></samp>&rsquo;, &lsquo;<samp><span class="samp">struct </span><var>struct-tag</var></samp>&rsquo;, &lsquo;<samp><span class="samp">union
</span><var>union-tag</var></samp>&rsquo; or &lsquo;<samp><span class="samp">enum </span><var>enum-tag</var></samp>&rsquo;.

     <p><var>flags</var> can be used to modify how the type is displayed. 
Available flags are:

          <dl>
<dt><code>r</code><dd>Display in &ldquo;raw&rdquo; form.  Normally, <span class="sc">gdb</span> substitutes template
parameters and typedefs defined in a class when printing the class'
members.  The <code>/r</code> flag disables this.

          <br><dt><code>m</code><dd>Do not print methods defined in the class.

          <br><dt><code>M</code><dd>Print methods defined in the class.  This is the default, but the flag
exists in case you change the default with <samp><span class="command">set print type methods</span></samp>.

          <br><dt><code>t</code><dd>Do not print typedefs defined in the class.  Note that this controls
whether the typedef definition itself is printed, not whether typedef
names are substituted when printing other types.

          <br><dt><code>T</code><dd>Print typedefs defined in the class.  This is the default, but the flag
exists in case you change the default with <samp><span class="command">set print type typedefs</span></samp>.

          <br><dt><code>o</code><dd>Print the offsets and sizes of fields in a struct, similar to what the
<samp><span class="command">pahole</span></samp> tool does.  This option implies the <code>/tm</code> flags.

          <p>For example, given the following declarations:

          <pre class="smallexample">               struct tuv
               {
                 int a1;
                 char *a2;
                 int a3;
               };
               
               struct xyz
               {
                 int f1;
                 char f2;
                 void *f3;
                 struct tuv f4;
               };
               
               union qwe
               {
                 struct tuv fff1;
                 struct xyz fff2;
               };
               
               struct tyu
               {
                 int a1 : 1;
                 int a2 : 3;
                 int a3 : 23;
                 char a4 : 2;
                 int64_t a5;
                 int a6 : 5;
                 int64_t a7 : 3;
               };
</pre>
          <p>Issuing a <kbd>ptype /o struct tuv</kbd> command would print:

          <pre class="smallexample">               (gdb) ptype /o struct tuv
               /* offset    |  size */  type = struct tuv {
               /*    0      |     4 */    int a1;
               /* XXX  4-byte hole  */
               /*    8      |     8 */    char *a2;
               /*   16      |     4 */    int a3;
               
                                          /* total size (bytes):   24 */
                                        }
</pre>
          <p>Notice the format of the first column of comments.  There, you can
find two parts separated by the &lsquo;<samp><span class="samp">|</span></samp>&rsquo; character: the <em>offset</em>,
which indicates where the field is located inside the struct, in
bytes, and the <em>size</em> of the field.  Another interesting line is
the marker of a <em>hole</em> in the struct, indicating that it may be
possible to pack the struct and make it use less space by reorganizing
its fields.

          <p>It is also possible to print offsets inside an union:

          <pre class="smallexample">               (gdb) ptype /o union qwe
               /* offset    |  size */  type = union qwe {
               /*                24 */    struct tuv {
               /*    0      |     4 */        int a1;
               /* XXX  4-byte hole  */
               /*    8      |     8 */        char *a2;
               /*   16      |     4 */        int a3;
               
                                              /* total size (bytes):   24 */
                                          } fff1;
               /*                40 */    struct xyz {
               /*    0      |     4 */        int f1;
               /*    4      |     1 */        char f2;
               /* XXX  3-byte hole  */
               /*    8      |     8 */        void *f3;
               /*   16      |    24 */        struct tuv {
               /*   16      |     4 */            int a1;
               /* XXX  4-byte hole  */
               /*   24      |     8 */            char *a2;
               /*   32      |     4 */            int a3;
               
                                                  /* total size (bytes):   24 */
                                              } f4;
               
                                              /* total size (bytes):   40 */
                                          } fff2;
               
                                          /* total size (bytes):   40 */
                                        }
</pre>
          <p>In this case, since <code>struct tuv</code> and <code>struct xyz</code> occupy the
same space (because we are dealing with an union), the offset is not
printed for them.  However, you can still examine the offset of each
of these structures' fields.

          <p>Another useful scenario is printing the offsets of a struct containing
bitfields:

          <pre class="smallexample">               (gdb) ptype /o struct tyu
               /* offset    |  size */  type = struct tyu {
               /*    0:31   |     4 */    int a1 : 1;
               /*    0:28   |     4 */    int a2 : 3;
               /*    0: 5   |     4 */    int a3 : 23;
               /*    3: 3   |     1 */    signed char a4 : 2;
               /* XXX  3-bit hole   */
               /* XXX  4-byte hole  */
               /*    8      |     8 */    int64_t a5;
               /*   16:27   |     4 */    int a6 : 5;
               /*   16:56   |     8 */    int64_t a7 : 3;
               
                                          /* total size (bytes):   24 */
                                        }
</pre>
          <p>Note how the offset information is now extended to also include how
many bits are left to be used in each bitfield. 
</dl>

     <p><a name="index-ptype-1118"></a><br><dt><code>ptype[/</code><var>flags</var><code>] [</code><var>arg</var><code>]</code><dd><code>ptype</code> accepts the same arguments as <code>whatis</code>, but prints a
detailed description of the type, instead of just the name of the type. 
See <a href="Expressions.html#Expressions">Expressions</a>.

     <p>Contrary to <code>whatis</code>, <code>ptype</code> always unrolls any
<code>typedef</code>s in its argument declaration, whether the argument is
a variable, expression, or a data type.  This means that <code>ptype</code>
of a variable or an expression will not print literally its type as
